#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h> 
//int main()
//{
//	int a = 5 / 2;//商2余1，两边都是整数只能打印出整数
//	//任一边是小数就能打印出小数，用浮点型
//	int a = 5 % 2;//%左右两边都必须是整数
//	printf("%d", a);
//	return 0;
//}

//--->>--右移操作符
//1.算术右移
//右边丢弃，左边补原符号位
//2.逻辑右移
//右边丢弃，左边补0
//
//整数的二进制表示有原码——>反码——>补码
//                     按位取反   加1
//储存到内存的是补码
//int main()
//{
//	int a = 6;
//	int b = a >> 1;
//	printf("%d", b);
//	return 0;
//}

//---<<---左移操作符
//左边丢弃，右边补0

//int main()
//{
//	int a = 6;
//	int b = a << 1;
//	printf("%d", b);
//	return 0;
//}
////左移一位乘2，右移一位除2,只能用于整数

//&---按位与操作符---有0为0，全1为1
//int main()
//{
//	int a = 3;
//	//00000000000000000000000000000011
//	int b = 2;
//	//00000000000000000000000000000010
//	int c = a & b;
//	//00000000000000000000000000000010
//	printf("%d", c);
//	return 0;
//}

//|---按位或操作符--有1为1，全0为0
//int main()
//{
//	int a = 3;
//	//00000000000000000000000000000011
//	int b = 4;
//	//00000000000000000000000000000100
//	int c = a | b;
//	//00000000000000000000000000000111
//	printf("%d", c);
//	return 0;
//}

//^---按位异或---相同为0，相异为1
//int main()
//{
//	int a = 4;
//	//00000000000000000000000000000100
//	int b = 5;
//	//00000000000000000000000000000101
//	int c = a ^ b;
//	//00000000000000000000000000000001
//	printf("%d", c);
//	return 0;
//}

//不使用第三个变量交换两个变量的值
int main()
{
	int a = 5;//101
	int b = 3;//011
	printf("交换前a=%d,b=%d\n", a, b);
	a = a ^ b;//110
	b = a ^ b;//101
	a = a ^ b;//011
	printf("交换后a=%d,b=%d", a, b);

}

//求一个 整数储存在内存中二进制的1的个数
//int main()
//{
//	int num = 0;
//	scanf("%d", &num);
//	int i;
//	int count = 0;
//	for (i = 0; i < 32; i++)
//	{
//		if ((num >> i) & 1 == 1)
//			count++;
//	}
//	printf("%d", count);
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	int* p = &a;//&取地址操作符
//	*p = 20;//解引用操作符
//	printf("a=%d", a);
//	return 0;
//}

//int main()
//{
//	//sizeof计算的是所占内存空间大小的值，单位是字节
//	int a = 10;
//	char c = 'r';
//	char* p = &c;
//	int arr[100] = { 0 };
//	printf("%d\n", sizeof(a));//4
//	printf("%d\n", sizeof(c));//1
//	printf("%d\n", sizeof(p));//4
//	printf("%d\n", sizeof(arr));//400
//
//	return 0;
//}

//int main()
//{
//	short s = 0;
//	int a = 10;
//	printf("%d\n", sizeof(s=a+5));//2
//	printf("%d\n", s);//0
//	return 0;
//}

//int main()
//{
//	int a = 0;
//	//~按（二进制）位取反操作符
//	//00000000000000000000000000000000--a的原码
//	//11111111111111111111111111111111--a的补码，存在内存中的a
//	//11111111111111111111111111111110--按位取反后的~a的反码
//	//10000000000000000000000000000001--~a的原码
//	printf("%d\n", ~a);
//	return 0;
//}

//int text1(int arr[])//内存地址占4个字节
//{
//	printf("%d\n", sizeof(arr));//4，指针的大小
//}
//int text2(char ch[]//内存地址占4个字节
//{
//	printf("%d", sizeof(ch));//4
//}
//int main()
//{
//	int arr[10] = { 0 };
//	char ch[10] = { 0 };
//	printf("%d\n", sizeof(arr));//40
//	printf("%d\n", sizeof(ch));//10
//	text1(arr);//传过去的参数是首元素的地址，需要用指针来接收
//	text2(ch);//传过去的参数是首元素的地址，需要用指针来接收 
//	 return 0;
//}

//&&--逻辑与，||--逻辑或
//int main()
//{
//	//&&左边为假就不算后面，||左边为真就不算后面
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	//i = a++ && ++b && d++;//1234
//	//&&中左边为0就不会算后面的了
//	//i = a++ || ++b || d++;//1334
//	//||前面为真后面的就不会算了
//	printf("a=%d,b=%d,c=%d,d=%d", a, b, c, d);
//	return 0;
//}

//条件操作符
//int main()
//{
//	int a = 0;
//	int b;
//	b = a > 5 ? 3 : -3;
//	printf("%d", b);
//	return 0;
//}

//int main()
//{
//	int a, b, c;
//	scanf("%d%d", &a, &b);
//	c = (a > b ? a : b);
//	printf("c=%d", c);
//	return 0;
//}

//逗号表达式
//就是用逗号隔开的多个表达式，从左向右依次执行，
//整个表达式的结果是最后一个表达式的结果
//int main()
//{
//	int a = 1;
//	int b = 2;
//	int c = ((a > b, a=a + b, a=0),  b + 10);
//	printf("a=%d\n", a);
//	printf("b=%d\n", b);
//    printf("c=%d\n", c);
//	return 0;
//}

//()函数调用操作符
//调用函数的时候（）叫函数操作符
//int get_max(int a, int b)//这不是函数操作符
//{
//	return a > b ? a : b;
//}
//int main()
//{
//	int a = 10;
//	int b = 49;
//	int max = get_max(a, b);//这是函数操作符
//	//3个操作数：get_max,a,b
//	printf("max=%d\n", max);
//	return 0;
//}

//  .操作符
//创建一个结构体类型
//struct stu
//{
//	char name[20];
//	int age;
//	char id[20];
//};
//int main()
//{
//	//使用struct stu这个类型创建一个学生对象s1，并初始化
//	struct stu s1 = { "张三",10,"2020304030257" };
//
//	struct stu* p = &s1;
//	printf("%s\n", p->name);
//	//结构体变量->成员名
//	printf("%s\n", (*p).name);
//	printf("%d\n", (*p).age);
//	printf("%s\n", (*p).id);
//	printf("%s\n", s1.name);
//	printf("%d\n", s1.age);
//	printf("%s\n", s1.id);
//	//结构体变量.成员名
//	return 0;
//}


//int main()
//{
//	char a = 3;
//	//00000000000000000000000000000011
//	//char只能放一个字节的内容，发生截断
//	//00000011从最低位开始截断-----a
//	char b = 127;
//	//00000000000000000000000001111111
//	//截断：01111111---------------b
//	//a+b:
//	//先整形提升，有符号的数按符号位提升，高位补充符号位（无符号数高位补0）
//	//a:00000011-->00000000000000000000000000000011
//	//b:01111111-->00000000000000000000000001111111
//	//然后相加：
//	//c:00000000000000000000000010000010---补码
//	//存在内存中的是补码，打印出的是原码，所以要求出原码
//	//反码：补码-1：000000000000000000000000010000001
//	//原码：按位取反：111111111111111111111111101111110
//	//因为c是char型，截断：01111110
//	char c = a + b;
//	printf("%d\n", c);
//	return 0;
//}


//int main()
//{
//	char c = 1;
//	printf("%u\n", sizeof(c));//1
//	printf("%u\n", sizeof(+c));//4
//	//c只要参与表达式运算就会发生整形提升，+c就会发生提升，所以是4个字节
//	printf("%u\n", sizeof(!c));//1
//	return 0;
//}

  